scripts/soapRequests/logOnTest-works.xml

<soap:Envelope xmlns:s0="http://www.cognitomobile.com/schemas/Iface/MobDataEngPushItf/InterfaceIO.xsd" xmlns:s2="http://www.cognitomobile.com/schemas/Common/Errors.xsd" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:msg="http://www.cognitomobile.com/schemas/Common/Mobile/Msg.xsd" xmlns:tns="http://www.cognitomobile.com/services/Iface/Engine/MobDataEngPushItf" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Header/><soap:Body><ReceiveMobDataParams xmlns="http://www.cognitomobile.com/schemas/Iface/MobDataEngPushItf/InterfaceIO.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><msg:Msg xmlns="http://www.cognitomobile.com/schemas/Common/Mobile/Msg.xsd"><msg:Head><msg:ID>15487</msg:ID><msg:Times><msg:Sent>2015-09-03T09:35:07Z</msg:Sent><msg:Networked>2015-09-03T09:35:16Z</msg:Networked><msg:Trace><msg:SvcId>10003</msg:SvcId><msg:Recv>2015-09-03T09:35:17Z</msg:Recv><msg:Fwd>2015-09-03T08:35:19.398Z</msg:Fwd></msg:Trace></msg:Times><msg:From><msg:UA>#249360</msg:UA><msg:User>6647</msg:User><msg:Custom><LabourCode xmlns="">6647</LabourCode></msg:Custom></msg:From></msg:Head><msg:Env><msg:To><msg:User>user</msg:User></msg:To><msg:Content><cus:Custom xmlns:CogCommonXPath="java://CogCommonXPath" xmlns:cus="http://www.cognitomobile.com/schemas/Common/Mobile/MsgContent/Custom.xsd" xmlns:log="http://www.gshgroup.com/schemas/formsplus/logon" xmlns:mfp="http://www.cognitomobile.com/schemas/Common/Mobile/MsgContent/FormsP.xsd" xmlns:tib="http://www.tibco.com/bw/xslt/custom-functions"><log:LogOn><log:Version>1.8.39</log:Version><log:CognitoDeviceID>#249360</log:CognitoDeviceID><log:SentTimeDate>2015-09-03T08:35:07+01:00</log:SentTimeDate><log:LogOnTimeDate>2015-09-03T09:35:07+01:00</log:LogOnTimeDate><log:LocationStatus>0</log:LocationStatus><log:LabourCode>6647</log:LabourCode><log:LoginValue>34</log:LoginValue><log:VehicleUser>Yes</log:VehicleUser><log:VehicleReg>HGHH</log:VehicleReg><log:ValidCarTax>1</log:ValidCarTax><log:FailureNotes>notes</log:FailureNotes><log:Tyres>1</log:Tyres><log:Lights>2</log:Lights><log:WarningLights>1</log:WarningLights><log:Water>1</log:Water><log:Oil>1</log:Oil><log:Fuel>3</log:Fuel><log:Damage>1</log:Damage></log:LogOn></cus:Custom></msg:Content></msg:Env></msg:Msg></ReceiveMobDataParams></soap:Body></soap:Envelope>