scripts/soapRequests/logOn1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:s0="http://www.cognitomobile.com/schemas/Iface/MobDataEngPushItf/InterfaceIO.xsd" >
   <soapenv:Header/>
   <soapenv:Body>
      <s0:ReceiveMobDataParams xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <s0:Msg xmlns="http://www.cognitomobile.com/schemas/Common/Mobile/Msg.xsd">
          <s0:Head>
            <s0:ID>15487</s0:ID>
            <s0:Times>
              <s0:Sent>2015-09-03T09:35:07Z</s0:Sent>
              <s0:Networked>2015-09-03T09:35:16Z</s0:Networked>
              <s0:Trace>
                <s0:SvcId>10003</s0:SvcId>
                <s0:Recv>2015-09-03T09:35:17Z</s0:Recv>
                <s0:Fwd>2015-09-03T08:35:19.398Z</s0:Fwd>
              </s0:Trace>
            </s0:Times>
            <s0:From>
              <s0:UA>#249360</s0:UA>
              <s0:Custom>
                <s0:LabourCode xmlns="">6647</s0:LabourCode>
              </s0:Custom>
            </s0:From>
          </s0:Head>
          <s0:Env>
            <s0:To>
              <s0:User>user</s0:User>
            </s0:To>
            <s0:Content>
              <cus:Custom xmlns:cus="http://www.cognitomobile.com/schemas/Common/Mobile/MsgContent/Custom.xsd" xmlns:log="http://www.gshgroup.com/schemas/formsplus/logon" xmlns:tib="http://www.tibco.com/bw/xslt/custom-functions" xmlns:mfp="http://www.cognitomobile.com/schemas/Common/Mobile/MsgContent/FormsP.xsd" xmlns:CogCommonXPath="java://CogCommonXPath">
                <log:LogOn>
                  <log:Version>1.8.39</log:Version>
                  <log:CognitoDeviceID>#249360</log:CognitoDeviceID>
                  <log:SentTimeDate>2015-09-03T08:35:07+01:00</log:SentTimeDate>
                  <log:LogOnTimeDate>2015-09-03T09:35:07+01:00</log:LogOnTimeDate>
                  <log:LocationStatus>0</log:LocationStatus>
                  <log:LabourCode>6647</log:LabourCode>
                  <log:LoginValue>34</log:LoginValue>
                  <log:VehicleUser>Yes</log:VehicleUser>
                  <log:VehicleReg>HGHH</log:VehicleReg>
                  <log:ValidCarTax>1</log:ValidCarTax>
                  <log:FailureNotes>notes</log:FailureNotes>
                  <log:Tyres>1</log:Tyres>
                  <log:Lights>2</log:Lights>
                  <log:WarningLights>1</log:WarningLights>
                  <log:Water>1</log:Water>
                  <log:Oil>1</log:Oil>
                  <log:Fuel>3</log:Fuel>
                  <log:Damage>1</log:Damage>
                </log:LogOn>
              </cus:Custom>
            </s0:Content>
          </s0:Env>
        </s0:Msg>
      </s0:ReceiveMobDataParams>
   </soapenv:Body>
</soapenv:Envelope>